zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc55xxx/pinctrl/LPC55S36JHI48-pinctrl.h
#undef DMA0_TRIG040_PIO1_19
#undef DMA0_TRIG040_PIO1_20
#undef DMA0_TRIG040_PIO1_21
#undef DMA0_TRIG040_PIO1_22
#undef DMA0_TRIG040_PIO1_23
#undef DMA0_TRIG040_PIO1_24
#undef DMA0_TRIG040_PIO1_25
#undef DMA0_TRIG040_PIO1_26
#undef DMA0_TRIG040_PIO1_27
#undef DMA0_TRIG040_PIO1_28
#undef DMA0_TRIG040_PIO1_29
#undef DMA0_TRIG040_PIO1_30
#undef DMA0_TRIG040_PIO1_31
#undef DMA0_TRIG040_PIO1_4
#undef DMA0_TRIG040_PIO1_5
#undef DMA0_TRIG040_PIO1_6
#undef DMA0_TRIG040_PIO1_7
#undef DMA0_TRIG040_PIO1_8
#undef DMA0_TRIG040_PIO1_9
#undef DMA0_TRIG041_PIO0_12
#undef DMA0_TRIG041_PIO0_22
#undef DMA0_TRIG041_PIO0_23
#undef DMA0_TRIG041_PIO0_25
#undef DMA0_TRIG041_PIO0_28
#undef DMA0_TRIG041_PIO0_31
#undef DMA0_TRIG041_PIO1_10
#undef DMA0_TRIG041_PIO1_12
#undef DMA0_TRIG041_PIO1_13
#undef DMA0_TRIG041_PIO1_14
#undef DMA0_TRIG041_PIO1_15
#undef DMA0_TRIG041_PIO1_16
#undef DMA0_TRIG041_PIO1_17
#undef DMA0_TRIG041_PIO1_18
#undef DMA0_TRIG041_PIO1_19
#undef DMA0_TRIG041_PIO1_20
#undef DMA0_TRIG041_PIO1_21
#undef DMA0_TRIG041_PIO1_22
#undef DMA0_TRIG041_PIO1_23
#undef DMA0_TRIG041_PIO1_24
#undef DMA0_TRIG041_PIO1_25
#undef DMA0_TRIG041_PIO1_26
#undef DMA0_TRIG041_PIO1_27
#undef DMA0_TRIG041_PIO1_28
#undef DMA0_TRIG041_PIO1_29
#undef DMA0_TRIG041_PIO1_30
#undef DMA0_TRIG041_PIO1_31
#undef DMA0_TRIG041_PIO1_4
#undef DMA0_TRIG041_PIO1_5
#undef DMA0_TRIG041_PIO1_6
#undef DMA0_TRIG041_PIO1_7
#undef DMA0_TRIG041_PIO1_8
#undef DMA0_TRIG041_PIO1_9
#undef DMA0_TRIG042_PIO0_12
#undef DMA0_TRIG042_PIO0_22
#undef DMA0_TRIG042_PIO0_23
#undef DMA0_TRIG042_PIO0_25
#undef DMA0_TRIG042_PIO0_28
#undef DMA0_TRIG042_PIO0_31
#undef DMA0_TRIG042_PIO1_10
#undef DMA0_TRIG042_PIO1_12
#undef DMA0_TRIG042_PIO1_13
#undef DMA0_TRIG042_PIO1_14
#undef DMA0_TRIG042_PIO1_15
#undef DMA0_TRIG042_PIO1_16
#undef DMA0_TRIG042_PIO1_17
#undef DMA0_TRIG042_PIO1_18
#undef DMA0_TRIG042_PIO1_19
#undef DMA0_TRIG042_PIO1_20
#undef DMA0_TRIG042_PIO1_21
#undef DMA0_TRIG042_PIO1_22
#undef DMA0_TRIG042_PIO1_23
#undef DMA0_TRIG042_PIO1_24
#undef DMA0_TRIG042_PIO1_25
#undef DMA0_TRIG042_PIO1_26
#undef DMA0_TRIG042_PIO1_27
#undef DMA0_TRIG042_PIO1_28
#undef DMA0_TRIG042_PIO1_29
#undef DMA0_TRIG042_PIO1_30
#undef DMA0_TRIG042_PIO1_31
#undef DMA0_TRIG042_PIO1_4
#undef DMA0_TRIG042_PIO1_5
#undef DMA0_TRIG042_PIO1_6
#undef DMA0_TRIG042_PIO1_7
#undef DMA0_TRIG042_PIO1_8
#undef DMA0_TRIG042_PIO1_9
#undef DMA0_TRIG043_PIO0_12
#undef DMA0_TRIG043_PIO0_22
#undef DMA0_TRIG043_PIO0_23
#undef DMA0_TRIG043_PIO0_25
#undef DMA0_TRIG043_PIO0_28
#undef DMA0_TRIG043_PIO0_31
#undef DMA0_TRIG043_PIO1_10
#undef DMA0_TRIG043_PIO1_12
#undef DMA0_TRIG043_PIO1_13
#undef DMA0_TRIG043_PIO1_14
#undef DMA0_TRIG043_PIO1_15
#undef DMA0_TRIG043_PIO1_16
#undef DMA0_TRIG043_PIO1_17
#undef DMA0_TRIG043_PIO1_18
#undef DMA0_TRIG043_PIO1_19
#undef DMA0_TRIG043_PIO1_20
#undef DMA0_TRIG043_PIO1_21
#undef DMA0_TRIG043_PIO1_22
#undef DMA0_TRIG043_PIO1_23
#undef DMA0_TRIG043_PIO1_24
#undef DMA0_TRIG043_PIO1_25
#undef DMA0_TRIG043_PIO1_26
#undef DMA0_TRIG043_PIO1_27
#undef DMA0_TRIG043_PIO1_28
#undef DMA0_TRIG043_PIO1_29
#undef DMA0_TRIG043_PIO1_30
#undef DMA0_TRIG043_PIO1_31
#undef DMA0_TRIG043_PIO1_4
#undef DMA0_TRIG043_PIO1_5
#undef DMA0_TRIG043_PIO1_6
#undef DMA0_TRIG043_PIO1_7
#undef DMA0_TRIG043_PIO1_8
#undef DMA0_TRIG043_PIO1_9
#undef DMA0_TRIG044_PIO0_12
#undef DMA0_TRIG044_PIO0_22
#undef DMA0_TRIG044_PIO0_23
#undef DMA0_TRIG044_PIO0_25
#undef DMA0_TRIG044_PIO0_28
#undef DMA0_TRIG044_PIO0_31
#undef DMA0_TRIG044_PIO1_10
#undef DMA0_TRIG044_PIO1_12
#undef DMA0_TRIG044_PIO1_13
#undef DMA0_TRIG044_PIO1_14
#undef DMA0_TRIG044_PIO1_15
#undef DMA0_TRIG044_PIO1_16
#undef DMA0_TRIG044_PIO1_17
#undef DMA0_TRIG044_PIO1_18
#undef DMA0_TRIG044_PIO1_19
#undef DMA0_TRIG044_PIO1_20
#undef DMA0_TRIG044_PIO1_21
#undef DMA0_TRIG044_PIO1_22
#undef DMA0_TRIG044_PIO1_23
#undef DMA0_TRIG044_PIO1_24
#undef DMA0_TRIG044_PIO1_25
#undef DMA0_TRIG044_PIO1_26
#undef DMA0_TRIG044_PIO1_27
#undef DMA0_TRIG044_PIO1_28
#undef DMA0_TRIG044_PIO1_29
#undef DMA0_TRIG044_PIO1_30
#undef DMA0_TRIG044_PIO1_31
#undef DMA0_TRIG044_PIO1_4
#undef DMA0_TRIG044_PIO1_5
#undef DMA0_TRIG044_PIO1_6
#undef DMA0_TRIG044_PIO1_7
#undef DMA0_TRIG044_PIO1_8
#undef DMA0_TRIG044_PIO1_9
#undef DMA0_TRIG045_PIO0_12
#undef DMA0_TRIG045_PIO0_22
#undef DMA0_TRIG045_PIO0_23
#undef DMA0_TRIG045_PIO0_25
#undef DMA0_TRIG045_PIO0_28
#undef DMA0_TRIG045_PIO0_31
#undef DMA0_TRIG045_PIO1_10
#undef DMA0_TRIG045_PIO1_12
#undef DMA0_TRIG045_PIO1_13
#undef DMA0_TRIG045_PIO1_14
#undef DMA0_TRIG045_PIO1_15
#undef DMA0_TRIG045_PIO1_16
#undef DMA0_TRIG045_PIO1_17
#undef DMA0_TRIG045_PIO1_18
#undef DMA0_TRIG045_PIO1_19
#undef DMA0_TRIG045_PIO1_20
#undef DMA0_TRIG045_PIO1_21
#undef DMA0_TRIG045_PIO1_22
#undef DMA0_TRIG045_PIO1_23
#undef DMA0_TRIG045_PIO1_24
#undef DMA0_TRIG045_PIO1_25
#undef DMA0_TRIG045_PIO1_26
#undef DMA0_TRIG045_PIO1_27
#undef DMA0_TRIG045_PIO1_28
#undef DMA0_TRIG045_PIO1_29
#undef DMA0_TRIG045_PIO1_30
#undef DMA0_TRIG045_PIO1_31
#undef DMA0_TRIG045_PIO1_4
#undef DMA0_TRIG045_PIO1_5
#undef DMA0_TRIG045_PIO1_6
#undef DMA0_TRIG045_PIO1_7
#undef DMA0_TRIG045_PIO1_8
#undef DMA0_TRIG045_PIO1_9
#undef DMA0_TRIG046_PIO0_12
#undef DMA0_TRIG046_PIO0_22
#undef DMA0_TRIG046_PIO0_23
#undef DMA0_TRIG046_PIO0_25
#undef DMA0_TRIG046_PIO0_28
#undef DMA0_TRIG046_PIO0_31
#undef DMA0_TRIG046_PIO1_10
#undef DMA0_TRIG046_PIO1_12
#undef DMA0_TRIG046_PIO1_13
#undef DMA0_TRIG046_PIO1_14
#undef DMA0_TRIG046_PIO1_15
#undef DMA0_TRIG046_PIO1_16
#undef DMA0_TRIG046_PIO1_17
#undef DMA0_TRIG046_PIO1_18
#undef DMA0_TRIG046_PIO1_19
#undef DMA0_TRIG046_PIO1_20
#undef DMA0_TRIG046_PIO1_21
#undef DMA0_TRIG046_PIO1_22
#undef DMA0_TRIG046_PIO1_23
#undef DMA0_TRIG046_PIO1_24
#undef DMA0_TRIG046_PIO1_25
#undef DMA0_TRIG046_PIO1_26
#undef DMA0_TRIG046_PIO1_27
#undef DMA0_TRIG046_PIO1_28
#undef DMA0_TRIG046_PIO1_29
#undef DMA0_TRIG046_PIO1_30
#undef DMA0_TRIG046_PIO1_31
#undef DMA0_TRIG046_PIO1_4
#undef DMA0_TRIG046_PIO1_5
#undef DMA0_TRIG046_PIO1_6
#undef DMA0_TRIG046_PIO1_7
#undef DMA0_TRIG046_PIO1_8
#undef DMA0_TRIG046_PIO1_9
#undef DMA0_TRIG047_PIO0_12
#undef DMA0_TRIG047_PIO0_22
#undef DMA0_TRIG047_PIO0_23
#undef DMA0_TRIG047_PIO0_25
#undef DMA0_TRIG047_PIO0_28
#undef DMA0_TRIG047_PIO0_31
#undef DMA0_TRIG047_PIO1_10
#undef DMA0_TRIG047_PIO1_12
#undef DMA0_TRIG047_PIO1_13
#undef DMA0_TRIG047_PIO1_14
#undef DMA0_TRIG047_PIO1_15
#undef DMA0_TRIG047_PIO1_16
#undef DMA0_TRIG047_PIO1_17
#undef DMA0_TRIG047_PIO1_18
#undef DMA0_TRIG047_PIO1_19
#undef DMA0_TRIG047_PIO1_20
#undef DMA0_TRIG047_PIO1_21
#undef DMA0_TRIG047_PIO1_22
#undef DMA0_TRIG047_PIO1_23
#undef DMA0_TRIG047_PIO1_24
#undef DMA0_TRIG047_PIO1_25
#undef DMA0_TRIG047_PIO1_26
#undef DMA0_TRIG047_PIO1_27
#undef DMA0_TRIG047_PIO1_28
#undef DMA0_TRIG047_PIO1_29
#undef DMA0_TRIG047_PIO1_30
#undef DMA0_TRIG047_PIO1_31
#undef DMA0_TRIG047_PIO1_4
#undef DMA0_TRIG047_PIO1_5
#undef DMA0_TRIG047_PIO1_6
#undef DMA0_TRIG047_PIO1_7
#undef DMA0_TRIG047_PIO1_8
#undef DMA0_TRIG047_PIO1_9
#undef DMA0_TRIG048_PIO0_12
#undef DMA0_TRIG048_PIO0_22
#undef DMA0_TRIG048_PIO0_23
#undef DMA0_TRIG048_PIO0_25
#undef DMA0_TRIG048_PIO0_28
#undef DMA0_TRIG048_PIO0_31
#undef DMA0_TRIG048_PIO1_10
#undef DMA0_TRIG048_PIO1_12
#undef DMA0_TRIG048_PIO1_13
#undef DMA0_TRIG048_PIO1_14
#undef DMA0_TRIG048_PIO1_15
#undef DMA0_TRIG048_PIO1_16
#undef DMA0_TRIG048_PIO1_17
#undef DMA0_TRIG048_PIO1_18
#undef DMA0_TRIG048_PIO1_19
#undef DMA0_TRIG048_PIO1_20
#undef DMA0_TRIG048_PIO1_21
#undef DMA0_TRIG048_PIO1_22
#undef DMA0_TRIG048_PIO1_23
#undef DMA0_TRIG048_PIO1_24
#undef DMA0_TRIG048_PIO1_25
#undef DMA0_TRIG048_PIO1_26
#undef DMA0_TRIG048_PIO1_27
#undef DMA0_TRIG048_PIO1_28
#undef DMA0_TRIG048_PIO1_29
#undef DMA0_TRIG048_PIO1_30
#undef DMA0_TRIG048_PIO1_31
#undef DMA0_TRIG048_PIO1_4
#undef DMA0_TRIG048_PIO1_5
#undef DMA0_TRIG048_PIO1_6
#undef DMA0_TRIG048_PIO1_7
#undef DMA0_TRIG048_PIO1_8
#undef DMA0_TRIG048_PIO1_9
#undef DMA0_TRIG049_PIO0_12
#undef DMA0_TRIG049_PIO0_22
#undef DMA0_TRIG049_PIO0_23
#undef DMA0_TRIG049_PIO0_25
#undef DMA0_TRIG049_PIO0_28
#undef DMA0_TRIG049_PIO0_31
#undef DMA0_TRIG049_PIO1_10
#undef DMA0_TRIG049_PIO1_12
#undef DMA0_TRIG049_PIO1_13
#undef DMA0_TRIG049_PIO1_14
#undef DMA0_TRIG049_PIO1_15
#undef DMA0_TRIG049_PIO1_16
#undef DMA0_TRIG049_PIO1_17
#undef DMA0_TRIG049_PIO1_18
#undef DMA0_TRIG049_PIO1_19
#undef DMA0_TRIG049_PIO1_20
#undef DMA0_TRIG049_PIO1_21
#undef DMA0_TRIG049_PIO1_22
#undef DMA0_TRIG049_PIO1_23
#undef DMA0_TRIG049_PIO1_24
#undef DMA0_TRIG049_PIO1_25
#undef DMA0_TRIG049_PIO1_26
#undef DMA0_TRIG049_PIO1_27
#undef DMA0_TRIG049_PIO1_28
#undef DMA0_TRIG049_PIO1_29
#undef DMA0_TRIG049_PIO1_30
#undef DMA0_TRIG049_PIO1_31
#undef DMA0_TRIG049_PIO1_4
#undef DMA0_TRIG049_PIO1_5
#undef DMA0_TRIG049_PIO1_6
#undef DMA0_TRIG049_PIO1_7
#undef DMA0_TRIG049_PIO1_8
#undef DMA0_TRIG049_PIO1_9
#undef DMA0_TRIG04_PIO0_12
#undef DMA0_TRIG04_PIO0_22
#undef DMA0_TRIG04_PIO0_23
#undef DMA0_TRIG04_PIO0_25
#undef DMA0_TRIG04_PIO0_28
#undef DMA0_TRIG04_PIO0_31
#undef DMA0_TRIG04_PIO1_10
#undef DMA0_TRIG04_PIO1_12
#undef DMA0_TRIG04_PIO1_13
#undef DMA0_TRIG04_PIO1_14
#undef DMA0_TRIG04_PIO1_15
#undef DMA0_TRIG04_PIO1_16
#undef DMA0_TRIG04_PIO1_17
#undef DMA0_TRIG04_PIO1_18
#undef DMA0_TRIG04_PIO1_19
#undef DMA0_TRIG04_PIO1_20
#undef DMA0_TRIG04_PIO1_21
#undef DMA0_TRIG04_PIO1_22
#undef DMA0_TRIG04_PIO1_23
#undef DMA0_TRIG04_PIO1_24
#undef DMA0_TRIG04_PIO1_25
#undef DMA0_TRIG04_PIO1_26
#undef DMA0_TRIG04_PIO1_27
#undef DMA0_TRIG04_PIO1_28
#undef DMA0_TRIG04_PIO1_29
#undef DMA0_TRIG04_PIO1_30
#undef DMA0_TRIG04_PIO1_31
#undef DMA0_TRIG04_PIO1_4
#undef DMA0_TRIG04_PIO1_5
#undef DMA0_TRIG04_PIO1_6
#undef DMA0_TRIG04_PIO1_7
#undef DMA0_TRIG04_PIO1_8
#undef DMA0_TRIG04_PIO1_9
#undef DMA0_TRIG050_PIO0_12
#undef DMA0_TRIG050_PIO0_22
#undef DMA0_TRIG050_PIO0_23
#undef DMA0_TRIG050_PIO0_25
#undef DMA0_TRIG050_PIO0_28
#undef DMA0_TRIG050_PIO0_31
#undef DMA0_TRIG050_PIO1_10
#undef DMA0_TRIG050_PIO1_12
#undef DMA0_TRIG050_PIO1_13
#undef DMA0_TRIG050_PIO1_14
#undef DMA0_TRIG050_PIO1_15
#undef DMA0_TRIG050_PIO1_16
#undef DMA0_TRIG050_PIO1_17
#undef DMA0_TRIG050_PIO1_18
#undef DMA0_TRIG050_PIO1_19
#undef DMA0_TRIG050_PIO1_20
#undef DMA0_TRIG050_PIO1_21
#undef DMA0_TRIG050_PIO1_22
#undef DMA0_TRIG050_PIO1_23
#undef DMA0_TRIG050_PIO1_24
#undef DMA0_TRIG050_PIO1_25
#undef DMA0_TRIG050_PIO1_26
#undef DMA0_TRIG050_PIO1_27
#undef DMA0_TRIG050_PIO1_28
#undef DMA0_TRIG050_PIO1_29
#undef DMA0_TRIG050_PIO1_30
#undef DMA0_TRIG050_PIO1_31
#undef DMA0_TRIG050_PIO1_4
#undef DMA0_TRIG050_PIO1_5
#undef DMA0_TRIG050_PIO1_6
#undef DMA0_TRIG050_PIO1_7
#undef DMA0_TRIG050_PIO1_8
#undef DMA0_TRIG050_PIO1_9
#undef DMA0_TRIG051_PIO0_12
#undef DMA0_TRIG051_PIO0_22
#undef DMA0_TRIG051_PIO0_23
#undef DMA0_TRIG051_PIO0_25
#undef DMA0_TRIG051_PIO0_28
#undef DMA0_TRIG051_PIO0_31
#undef DMA0_TRIG051_PIO1_10
#undef DMA0_TRIG051_PIO1_12
#undef DMA0_TRIG051_PIO1_13
#undef DMA0_TRIG051_PIO1_14
#undef DMA0_TRIG051_PIO1_15
#undef DMA0_TRIG051_PIO1_16
#undef DMA0_TRIG051_PIO1_17
#undef DMA0_TRIG051_PIO1_18
#undef DMA0_TRIG051_PIO1_19
#undef DMA0_TRIG051_PIO1_20
#undef DMA0_TRIG051_PIO1_21
#undef DMA0_TRIG051_PIO1_22
#undef DMA0_TRIG051_PIO1_23
#undef DMA0_TRIG051_PIO1_24
#undef DMA0_TRIG051_PIO1_25
#undef DMA0_TRIG051_PIO1_26
#undef DMA0_TRIG051_PIO1_27
#undef DMA0_TRIG051_PIO1_28
#undef DMA0_TRIG051_PIO1_29
#undef DMA0_TRIG051_PIO1_30
#undef DMA0_TRIG051_PIO1_31
#undef DMA0_TRIG051_PIO1_4
#undef DMA0_TRIG051_PIO1_5
#undef DMA0_TRIG051_PIO1_6
#undef DMA0_TRIG051_PIO1_7
#undef DMA0_TRIG051_PIO1_8
#undef DMA0_TRIG051_PIO1_9
#undef DMA0_TRIG05_PIO0_12
#undef DMA0_TRIG05_PIO0_22
#undef DMA0_TRIG05_PIO0_23
#undef DMA0_TRIG05_PIO0_25
#undef DMA0_TRIG05_PIO0_28
#undef DMA0_TRIG05_PIO0_31
#undef DMA0_TRIG05_PIO1_10
#undef DMA0_TRIG05_PIO1_12
#undef DMA0_TRIG05_PIO1_13
#undef DMA0_TRIG05_PIO1_14
#undef DMA0_TRIG05_PIO1_15
#undef DMA0_TRIG05_PIO1_16
#undef DMA0_TRIG05_PIO1_17
#undef DMA0_TRIG05_PIO1_18
#undef DMA0_TRIG05_PIO1_19
#undef DMA0_TRIG05_PIO1_20
#undef DMA0_TRIG05_PIO1_21
#undef DMA0_TRIG05_PIO1_22
#undef DMA0_TRIG05_PIO1_23
#undef DMA0_TRIG05_PIO1_24
#undef DMA0_TRIG05_PIO1_25
#undef DMA0_TRIG05_PIO1_26
#undef DMA0_TRIG05_PIO1_27
#undef DMA0_TRIG05_PIO1_28
#undef DMA0_TRIG05_PIO1_29
#undef DMA0_TRIG05_PIO1_30
#undef DMA0_TRIG05_PIO1_31
#undef DMA0_TRIG05_PIO1_4
#undef DMA0_TRIG05_PIO1_5
#undef DMA0_TRIG05_PIO1_6
#undef DMA0_TRIG05_PIO1_7
#undef DMA0_TRIG05_PIO1_8
#undef DMA0_TRIG05_PIO1_9
#undef DMA0_TRIG06_PIO0_12
#undef DMA0_TRIG06_PIO0_22
#undef DMA0_TRIG06_PIO0_23
#undef DMA0_TRIG06_PIO0_25
#undef DMA0_TRIG06_PIO0_28
#undef DMA0_TRIG06_PIO0_31
#undef DMA0_TRIG06_PIO1_10
#undef DMA0_TRIG06_PIO1_12
#undef DMA0_TRIG06_PIO1_13
#undef DMA0_TRIG06_PIO1_14
#undef DMA0_TRIG06_PIO1_15
#undef DMA0_TRIG06_PIO1_16
#undef DMA0_TRIG06_PIO1_17
#undef DMA0_TRIG06_PIO1_18
#undef DMA0_TRIG06_PIO1_19
#undef DMA0_TRIG06_PIO1_20
#undef DMA0_TRIG06_PIO1_21
#undef DMA0_TRIG06_PIO1_22
#undef DMA0_TRIG06_PIO1_23
#undef DMA0_TRIG06_PIO1_24
#undef DMA0_TRIG06_PIO1_25
#undef DMA0_TRIG06_PIO1_26
#undef DMA0_TRIG06_PIO1_27
#undef DMA0_TRIG06_PIO1_28
#undef DMA0_TRIG06_PIO1_29
#undef DMA0_TRIG06_PIO1_30
#undef DMA0_TRIG06_PIO1_31
#undef DMA0_TRIG06_PIO1_4
#undef DMA0_TRIG06_PIO1_5
#undef DMA0_TRIG06_PIO1_6
#undef DMA0_TRIG06_PIO1_7
#undef DMA0_TRIG06_PIO1_8
#undef DMA0_TRIG06_PIO1_9
#undef DMA0_TRIG07_PIO0_12
#undef DMA0_TRIG07_PIO0_22
#undef DMA0_TRIG07_PIO0_23
#undef DMA0_TRIG07_PIO0_25
#undef DMA0_TRIG07_PIO0_28
#undef DMA0_TRIG07_PIO0_31
#undef DMA0_TRIG07_PIO1_10
#undef DMA0_TRIG07_PIO1_12
#undef DMA0_TRIG07_PIO1_13
#undef DMA0_TRIG07_PIO1_14
#undef DMA0_TRIG07_PIO1_15
#undef DMA0_TRIG07_PIO1_16
#undef DMA0_TRIG07_PIO1_17
#undef DMA0_TRIG07_PIO1_18
#undef DMA0_TRIG07_PIO1_19
#undef DMA0_TRIG07_PIO1_20
#undef DMA0_TRIG07_PIO1_21
#undef DMA0_TRIG07_PIO1_22
#undef DMA0_TRIG07_PIO1_23
#undef DMA0_TRIG07_PIO1_24
#undef DMA0_TRIG07_PIO1_25
#undef DMA0_TRIG07_PIO1_26
#undef DMA0_TRIG07_PIO1_27
#undef DMA0_TRIG07_PIO1_28
#undef DMA0_TRIG07_PIO1_29
#undef DMA0_TRIG07_PIO1_30
#undef DMA0_TRIG07_PIO1_31
#undef DMA0_TRIG07_PIO1_4
#undef DMA0_TRIG07_PIO1_5
#undef DMA0_TRIG07_PIO1_6
#undef DMA0_TRIG07_PIO1_7
#undef DMA0_TRIG07_PIO1_8
#undef DMA0_TRIG07_PIO1_9
#undef DMA0_TRIG08_PIO0_12
#undef DMA0_TRIG08_PIO0_22
#undef DMA0_TRIG08_PIO0_23
#undef DMA0_TRIG08_PIO0_25
#undef DMA0_TRIG08_PIO0_28
#undef DMA0_TRIG08_PIO0_31
#undef DMA0_TRIG08_PIO1_10
#undef DMA0_TRIG08_PIO1_12
#undef DMA0_TRIG08_PIO1_13
#undef DMA0_TRIG08_PIO1_14
#undef DMA0_TRIG08_PIO1_15
#undef DMA0_TRIG08_PIO1_16
#undef DMA0_TRIG08_PIO1_17
#undef DMA0_TRIG08_PIO1_18
#undef DMA0_TRIG08_PIO1_19
#undef DMA0_TRIG08_PIO1_20
#undef DMA0_TRIG08_PIO1_21
#undef DMA0_TRIG08_PIO1_22
#undef DMA0_TRIG08_PIO1_23
#undef DMA0_TRIG08_PIO1_24
#undef DMA0_TRIG08_PIO1_25
#undef DMA0_TRIG08_PIO1_26
#undef DMA0_TRIG08_PIO1_27
#undef DMA0_TRIG08_PIO1_28
#undef DMA0_TRIG08_PIO1_29
#undef DMA0_TRIG08_PIO1_30
#undef DMA0_TRIG08_PIO1_31
#undef DMA0_TRIG08_PIO1_4
#undef DMA0_TRIG08_PIO1_5
#undef DMA0_TRIG08_PIO1_6
#undef DMA0_TRIG08_PIO1_7
#undef DMA0_TRIG08_PIO1_8
#undef DMA0_TRIG08_PIO1_9
#undef DMA0_TRIG09_PIO0_12
#undef DMA0_TRIG09_PIO0_22
#undef DMA0_TRIG09_PIO0_23
#undef DMA0_TRIG09_PIO0_25
#undef DMA0_TRIG09_PIO0_28
#undef DMA0_TRIG09_PIO0_31
#undef DMA0_TRIG09_PIO1_10
#undef DMA0_TRIG09_PIO1_12
#undef DMA0_TRIG09_PIO1_13
#undef DMA0_TRIG09_PIO1_14
#undef DMA0_TRIG09_PIO1_15
#undef DMA0_TRIG09_PIO1_16
#undef DMA0_TRIG09_PIO1_17
#undef DMA0_TRIG09_PIO1_18
#undef DMA0_TRIG09_PIO1_19
#undef DMA0_TRIG09_PIO1_20
#undef DMA0_TRIG09_PIO1_21
#undef DMA0_TRIG09_PIO1_22
#undef DMA0_TRIG09_PIO1_23
#undef DMA0_TRIG09_PIO1_24
#undef DMA0_TRIG09_PIO1_25
#undef DMA0_TRIG09_PIO1_26
#undef DMA0_TRIG09_PIO1_27
#undef DMA0_TRIG09_PIO1_28
#undef DMA0_TRIG09_PIO1_29
#undef DMA0_TRIG09_PIO1_30
#undef DMA0_TRIG09_PIO1_31
#undef DMA0_TRIG09_PIO1_4
#undef DMA0_TRIG09_PIO1_5
#undef DMA0_TRIG09_PIO1_6
#undef DMA0_TRIG09_PIO1_7
#undef DMA0_TRIG09_PIO1_8
#undef DMA0_TRIG09_PIO1_9
#undef DMA1_TRIG10_PIO0_12
#undef DMA1_TRIG10_PIO0_22
#undef DMA1_TRIG10_PIO0_23
#undef DMA1_TRIG10_PIO0_25
#undef DMA1_TRIG10_PIO0_28
#undef DMA1_TRIG10_PIO0_31
#undef DMA1_TRIG10_PIO1_10
#undef DMA1_TRIG10_PIO1_12
#undef DMA1_TRIG10_PIO1_13
#undef DMA1_TRIG10_PIO1_14
#undef DMA1_TRIG10_PIO1_15
#undef DMA1_TRIG10_PIO1_16
#undef DMA1_TRIG10_PIO1_17
#undef DMA1_TRIG10_PIO1_18
#undef DMA1_TRIG10_PIO1_19
#undef DMA1_TRIG10_PIO1_20
#undef DMA1_TRIG10_PIO1_21
#undef DMA1_TRIG10_PIO1_22
#undef DMA1_TRIG10_PIO1_23
#undef DMA1_TRIG10_PIO1_24
#undef DMA1_TRIG10_PIO1_25
#undef DMA1_TRIG10_PIO1_26
#undef DMA1_TRIG10_PIO1_27
#undef DMA1_TRIG10_PIO1_28
#undef DMA1_TRIG10_PIO1_29
#undef DMA1_TRIG10_PIO1_30
#undef DMA1_TRIG10_PIO1_31
#undef DMA1_TRIG10_PIO1_4
#undef DMA1_TRIG10_PIO1_5
#undef DMA1_TRIG10_PIO1_6
#undef DMA1_TRIG10_PIO1_7
#undef DMA1_TRIG10_PIO1_8
#undef DMA1_TRIG10_PIO1_9
#undef DMA1_TRIG11_PIO0_12
#undef DMA1_TRIG11_PIO0_22
#undef DMA1_TRIG11_PIO0_23
#undef DMA1_TRIG11_PIO0_25
#undef DMA1_TRIG11_PIO0_28
#undef DMA1_TRIG11_PIO0_31
#undef DMA1_TRIG11_PIO1_10
#undef DMA1_TRIG11_PIO1_12
#undef DMA1_TRIG11_PIO1_13
#undef DMA1_TRIG11_PIO1_14
#undef DMA1_TRIG11_PIO1_15
#undef DMA1_TRIG11_PIO1_16
#undef DMA1_TRIG11_PIO1_17
#undef DMA1_TRIG11_PIO1_18
#undef DMA1_TRIG11_PIO1_19
#undef DMA1_TRIG11_PIO1_20
#undef DMA1_TRIG11_PIO1_21
#undef DMA1_TRIG11_PIO1_22
#undef DMA1_TRIG11_PIO1_23
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_25
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_28
#undef DMA1_TRIG11_PIO1_29
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG11_PIO1_4
#undef DMA1_TRIG11_PIO1_5
#undef DMA1_TRIG11_PIO1_6
#undef DMA1_TRIG11_PIO1_7
#undef DMA1_TRIG11_PIO1_8
#undef DMA1_TRIG11_PIO1_9
#undef DMA1_TRIG12_PIO0_12
#undef DMA1_TRIG12_PIO0_22
#undef DMA1_TRIG12_PIO0_23
#undef DMA1_TRIG12_PIO0_25
#undef DMA1_TRIG12_PIO0_28
#undef DMA1_TRIG12_PIO0_31
#undef DMA1_TRIG12_PIO1_10
#undef DMA1_TRIG12_PIO1_12
#undef DMA1_TRIG12_PIO1_13
#undef DMA1_TRIG12_PIO1_14
#undef DMA1_TRIG12_PIO1_15
#undef DMA1_TRIG12_PIO1_16
#undef DMA1_TRIG12_PIO1_17
#undef DMA1_TRIG12_PIO1_18
#undef DMA1_TRIG12_PIO1_19
#undef DMA1_TRIG12_PIO1_20
#undef DMA1_TRIG12_PIO1_21
#undef DMA1_TRIG12_PIO1_22
#undef DMA1_TRIG12_PIO1_23
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_25
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_28
#undef DMA1_TRIG12_PIO1_29
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG12_PIO1_4
#undef DMA1_TRIG12_PIO1_5
#undef DMA1_TRIG12_PIO1_6
#undef DMA1_TRIG12_PIO1_7
#undef DMA1_TRIG12_PIO1_8
#undef DMA1_TRIG12_PIO1_9
#undef DMA1_TRIG13_PIO0_12
#undef DMA1_TRIG13_PIO0_22
#undef DMA1_TRIG13_PIO0_23
#undef DMA1_TRIG13_PIO0_25
#undef DMA1_TRIG13_PIO0_28
#undef DMA1_TRIG13_PIO0_31
#undef DMA1_TRIG13_PIO1_10
#undef DMA1_TRIG13_PIO1_12
#undef DMA1_TRIG13_PIO1_13
#undef DMA1_TRIG13_PIO1_14
#undef DMA1_TRIG13_PIO1_15
#undef DMA1_TRIG13_PIO1_16
#undef DMA1_TRIG13_PIO1_17
#undef DMA1_TRIG13_PIO1_18
#undef DMA1_TRIG13_PIO1_19
#undef DMA1_TRIG13_PIO1_20
#undef DMA1_TRIG13_PIO1_21
#undef DMA1_TRIG13_PIO1_22
#undef DMA1_TRIG13_PIO1_23
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_25
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_28
#undef DMA1_TRIG13_PIO1_29
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG13_PIO1_4
#undef DMA1_TRIG13_PIO1_5
#undef DMA1_TRIG13_PIO1_6
#undef DMA1_TRIG13_PIO1_7
#undef DMA1_TRIG13_PIO1_8
#undef DMA1_TRIG13_PIO1_9
#undef DMA1_TRIG14_PIO0_12
#undef DMA1_TRIG14_PIO0_22
#undef DMA1_TRIG14_PIO0_23
#undef DMA1_TRIG14_PIO0_25
#undef DMA1_TRIG14_PIO0_28
#undef DMA1_TRIG14_PIO0_31
#undef DMA1_TRIG14_PIO1_10
#undef DMA1_TRIG14_PIO1_12
#undef DMA1_TRIG14_PIO1_13
#undef DMA1_TRIG14_PIO1_14
#undef DMA1_TRIG14_PIO1_15
#undef DMA1_TRIG14_PIO1_16
#undef DMA1_TRIG14_PIO1_17
#undef DMA1_TRIG14_PIO1_18
#undef DMA1_TRIG14_PIO1_19
#undef DMA1_TRIG14_PIO1_20
#undef DMA1_TRIG14_PIO1_21
#undef DMA1_TRIG14_PIO1_22
#undef DMA1_TRIG14_PIO1_23
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_25
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_28
#undef DMA1_TRIG14_PIO1_29
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG14_PIO1_4
#undef DMA1_TRIG14_PIO1_5
#undef DMA1_TRIG14_PIO1_6
#undef DMA1_TRIG14_PIO1_7
#undef DMA1_TRIG14_PIO1_8
#undef DMA1_TRIG14_PIO1_9
#undef DMA1_TRIG15_PIO0_12
#undef DMA1_TRIG15_PIO0_22
#undef DMA1_TRIG15_PIO0_23
#undef DMA1_TRIG15_PIO0_25
#undef DMA1_TRIG15_PIO0_28
#undef DMA1_TRIG15_PIO0_31
#undef DMA1_TRIG15_PIO1_10
#undef DMA1_TRIG15_PIO1_12
#undef DMA1_TRIG15_PIO1_13
#undef DMA1_TRIG15_PIO1_14
#undef DMA1_TRIG15_PIO1_15
#undef DMA1_TRIG15_PIO1_16
#undef DMA1_TRIG15_PIO1_17
#undef DMA1_TRIG15_PIO1_18
#undef DMA1_TRIG15_PIO1_19
#undef DMA1_TRIG15_PIO1_20
#undef DMA1_TRIG15_PIO1_21
#undef DMA1_TRIG15_PIO1_22
#undef DMA1_TRIG15_PIO1_23
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_25
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_28
#undef DMA1_TRIG15_PIO1_29
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG15_PIO1_4
#undef DMA1_TRIG15_PIO1_5
#undef DMA1_TRIG15_PIO1_6
#undef DMA1_TRIG15_PIO1_7
#undef DMA1_TRIG15_PIO1_8
#undef DMA1_TRIG15_PIO1_9
#undef DMA1_TRIG16_PIO0_12
#undef DMA1_TRIG16_PIO0_22
#undef DMA1_TRIG16_PIO0_23
#undef DMA1_TRIG16_PIO0_25
#undef DMA1_TRIG16_PIO0_28
#undef DMA1_TRIG16_PIO0_31
#undef DMA1_TRIG16_PIO1_10
#undef DMA1_TRIG16_PIO1_12
#undef DMA1_TRIG16_PIO1_13
#undef DMA1_TRIG16_PIO1_14
#undef DMA1_TRIG16_PIO1_15
#undef DMA1_TRIG16_PIO1_16
#undef DMA1_TRIG16_PIO1_17
#undef DMA1_TRIG16_PIO1_18
#undef DMA1_TRIG16_PIO1_19
#undef DMA1_TRIG16_PIO1_20
#undef DMA1_TRIG16_PIO1_21
#undef DMA1_TRIG16_PIO1_22
#undef DMA1_TRIG16_PIO1_23
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_25
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_28
#undef DMA1_TRIG16_PIO1_29
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG16_PIO1_4
#undef DMA1_TRIG16_PIO1_5
#undef DMA1_TRIG16_PIO1_6
#undef DMA1_TRIG16_PIO1_7
#undef DMA1_TRIG16_PIO1_8
#undef DMA1_TRIG16_PIO1_9
#undef DMA1_TRIG17_PIO0_12
#undef DMA1_TRIG17_PIO0_22
#undef DMA1_TRIG17_PIO0_23
#undef DMA1_TRIG17_PIO0_25
#undef DMA1_TRIG17_PIO0_28
#undef DMA1_TRIG17_PIO0_31
#undef DMA1_TRIG17_PIO1_10
#undef DMA1_TRIG17_PIO1_12
#undef DMA1_TRIG17_PIO1_13
#undef DMA1_TRIG17_PIO1_14
#undef DMA1_TRIG17_PIO1_15
#undef DMA1_TRIG17_PIO1_16
#undef DMA1_TRIG17_PIO1_17
#undef DMA1_TRIG17_PIO1_18
#undef DMA1_TRIG17_PIO1_19
#undef DMA1_TRIG17_PIO1_20
#undef DMA1_TRIG17_PIO1_21
#undef DMA1_TRIG17_PIO1_22
#undef DMA1_TRIG17_PIO1_23
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_25
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_28
#undef DMA1_TRIG17_PIO1_29
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG17_PIO1_4
#undef DMA1_TRIG17_PIO1_5
#undef DMA1_TRIG17_PIO1_6
#undef DMA1_TRIG17_PIO1_7
#undef DMA1_TRIG17_PIO1_8
#undef DMA1_TRIG17_PIO1_9
#undef DMA1_TRIG18_PIO0_12
#undef DMA1_TRIG18_PIO0_22
#undef DMA1_TRIG18_PIO0_23
#undef DMA1_TRIG18_PIO0_25
#undef DMA1_TRIG18_PIO0_28
#undef DMA1_TRIG18_PIO0_31
#undef DMA1_TRIG18_PIO1_10
#undef DMA1_TRIG18_PIO1_12
#undef DMA1_TRIG18_PIO1_13
#undef DMA1_TRIG18_PIO1_14
#undef DMA1_TRIG18_PIO1_15
#undef DMA1_TRIG18_PIO1_16
#undef DMA1_TRIG18_PIO1_17
#undef DMA1_TRIG18_PIO1_18
#undef DMA1_TRIG18_PIO1_19
#undef DMA1_TRIG18_PIO1_20
#undef DMA1_TRIG18_PIO1_21
#undef DMA1_TRIG18_PIO1_22
#undef DMA1_TRIG18_PIO1_23
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_25
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_28
#undef DMA1_TRIG18_PIO1_29
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG18_PIO1_4
#undef DMA1_TRIG18_PIO1_5
#undef DMA1_TRIG18_PIO1_6
#undef DMA1_TRIG18_PIO1_7
#undef DMA1_TRIG18_PIO1_8
#undef DMA1_TRIG18_PIO1_9
#undef DMA1_TRIG19_PIO0_12
#undef DMA1_TRIG19_PIO0_22
#undef DMA1_TRIG19_PIO0_23
